# DisplayingOptionsDialog Event (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UIApplication..::..DisplayingOptionsDialog Event
UIApplication Class See Also
---
Subscribe to the options dialog displaying event to be notified when Revit options dialog is displaying.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public event EventHandler<DisplayingOptionsDialogEventArgs> DisplayingOptionsDialog
```

Visual Basic
---
```text
Public Event DisplayingOptionsDialog As EventHandler(Of DisplayingOptionsDialogEventArgs)
```

Visual C++
---
```text
public:
 event EventHandler<DisplayingOptionsDialogEventArgs^>^ DisplayingOptionsDialog {
	void add (EventHandler<DisplayingOptionsDialogEventArgs^>^ value);
	void remove (EventHandler<DisplayingOptionsDialogEventArgs^>^ value);
}
```

# See Also
UIApplication Class
Autodesk.Revit.UI Namespace